docs/black.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-03-19 Fri 20:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Black Python formatting</title>
<meta name="generator" content="Org mode">
<link rel='stylesheet' type='text/css' href='css/style.css' />
<link rel='icon' type='image/png' href='/favicon.png'>
</head>
<body>
<div id="org-div-home-and-up">
                               <a accesskey="H" href="/">Home</a>
                               </div><div id="content">
<header>
<h1 class="title">Black Python formatting</h1>
</header><p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>
</p>

<p>
<b>Black</b> is the uncompromising Python code formatter. It gives you speed, determinism, and freedom from <code>pycodestyle</code> nagging about formatting. You will save time and mental energy for more important matters.
</p>

<p>
Blackened code looks the same regardless of the project you're reading. Formatting becomes transparent after a while and you can focus on the content instead.
</p>

<p>
<b>Black</b> makes code review faster by producing the smallest diffs possible.
</p>


<div id="outline-container-org5027455" class="outline-2">
<h2 id="org5027455">Why</h2>
<div class="outline-text-2" id="text-org5027455">
<blockquote>
<p>
Black is opinionated so you don't have to be.
</p>
</blockquote>

<blockquote>
<p>
An auto-formatter that doesn't suck is all I want for Xmas!
</p>
</blockquote>

<blockquote>
<p>
At least the name is good.
</p>
</blockquote>

<p>
You can write in any style you want and autoformatting tools will make your code beautiful.
</p>

<p>
Don't waste your time arguing about code style. Black it, forget it.
</p>
</div>
</div>


<div id="outline-container-orgee16b34" class="outline-2">
<h2 id="orgee16b34">Usage</h2>
<div class="outline-text-2" id="text-orgee16b34">
</div>
<div id="outline-container-org625d0e9" class="outline-3">
<h3 id="org625d0e9">Install</h3>
<div class="outline-text-3" id="text-org625d0e9">
<div class="org-src-container">
<pre class="src src-sh">pip install black
</pre>
</div>
</div>
</div>

<div id="outline-container-orgafabd55" class="outline-3">
<h3 id="orgafabd55">Manually</h3>
<div class="outline-text-3" id="text-orgafabd55">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: brightgreen;"># </span><span style="color: brightgreen;">formats file in place</span>
black [file]

<span style="color: brightgreen;"># </span><span style="color: brightgreen;">just check</span>
black -c [file]

<span style="color: brightgreen;"># </span><span style="color: brightgreen;">just output a diff for each file</span>
black --diff [file]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdce4db0" class="outline-3">
<h3 id="orgdce4db0">Plugins</h3>
<div class="outline-text-3" id="text-orgdce4db0">
<p>
There are plugins for anything:
</p>

<ul class="org-ul">
<li>PyCharm</li>
<li>VSCode</li>
<li>Jupiter</li>
<li>Emacs</li>
<li>Vim</li>
<li>&#x2026;</li>
</ul>

<p>
For more info have a look at <a href="https://github.com/psf/black#editor-integration">Black Github Page</a>
</p>
</div>
</div>

<div id="outline-container-orgdc86c43" class="outline-3">
<h3 id="orgdc86c43">Git hook</h3>
<div class="outline-text-3" id="text-orgdc86c43">
<p>
Use git <code>pre-commit</code> hook.
</p>

<p>
It will automatically reformat files and add them to commit.
</p>

<p>
<b>File</b>: <code>.git/hooks/pre-commit</code>
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: brightgreen;">#</span><span style="color: brightgreen;">!/bin/</span><span style="color: #a020f0;">sh</span>

<span style="color: #483d8b;">set</span> -e

<span style="color: #ff00ff;">ROOT</span>=$(git rev-parse --show-toplevel)
<span style="color: #ff00ff;">FILES</span>=$(git diff --name-status --cached | awk <span style="color: #8b2252;">'{print "$2"}'</span> | grep <span style="color: #8b2252;">'\.py'</span> | xargs -I {} <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"$ROOT/{}"</span> | paste -sd <span style="color: #8b2252;">" "</span> - || <span style="color: #483d8b;">true</span>)

<span style="color: #a020f0;">if</span> [ -n <span style="color: #8b2252;">"$FILES"</span> ]; <span style="color: #a020f0;">then</span>
    black <span style="color: #8b2252;">"$FILES"</span>
    git add -u <span style="color: #8b2252;">"$FILES"</span>
<span style="color: #a020f0;">fi</span>
</pre>
</div>

<p>
To skip running pre commit hook, use <code>--no-verify</code>:
</p>

<p>
<code>git commit --no-verify</code>
</p>

<p>
<code>git commit --amend --no-edit --no-verify</code>
</p>
</div>
</div>

<div id="outline-container-org96e5476" class="outline-3">
<h3 id="org96e5476">CI</h3>
<div class="outline-text-3" id="text-org96e5476">
<p>
I think formatting should be checked in CI as well to prevent pushing unformatted code. This is the last line of defense.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb893bcd" class="outline-2">
<h2 id="orgb893bcd">Configuration</h2>
<div class="outline-text-2" id="text-orgb893bcd">
<p>
It's good by default and there is not a lot of things to config. The only thing you might want to configure is max line length.
To force line length, there is an argument:
</p>

<div class="org-src-container">
<pre class="src src-sh">-l, --line-length INTEGER       How many characters per line to allow.
                                  [default: 88]
</pre>
</div>

<p>
By default black using 88 chars limit. I think it is a good choice, but as for me it's more comfortable to have old good 79 characters. Then you can fit 2 panes of code side by side on the 13 inch display.
</p>

<p>
To force some black rules, toml file can be used. Place it in any subdirectory of git project, black will look for config file in parent directories until it gets to the root of git repo.
</p>

<p>
<b>File</b>: <code>pyproject.toml</code>
</p>

<div class="org-src-container">
<pre class="src src-ini">[tool.black]
line-length = 79
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb0a41ff" class="outline-2">
<h2 id="orgb0a41ff">Limitations</h2>
<div class="outline-text-2" id="text-orgb0a41ff">
<ul class="org-ul">
<li>Can't split string lines
There is an issue on GitHub, it's not trivial problem but not rocket science</li>
<li>Doesn't sort imports (but formats them)</li>
</ul>
</div>
</div>


<div id="outline-container-org169eaa4" class="outline-2">
<h2 id="org169eaa4">Code examples</h2>
<div class="outline-text-2" id="text-org169eaa4">
<p>
There are several popular and wide known open source projects using black.
</p>

<p>
You can have a look at their code to get an idea how it will look.
</p>

<ul class="org-ul">
<li><a href="https://github.com/tox-dev/tox">Tox</a></li>
<li><a href="https://github.com/pytest-dev/pytest">Pytest</a></li>
</ul>
</div>
</div>


<div id="outline-container-org1ffce9f" class="outline-2">
<h2 id="org1ffce9f">Links</h2>
<div class="outline-text-2" id="text-org1ffce9f">
<ol class="org-ol">
<li><a href="https://github.com/psf/black">Github</a></li>
<li><a href="https://black.readthedocs.io/en/stable/">Docs</a></li>
<li><a href="https://www.youtube.com/watch?v=esZLCuWs_2Y&amp;feature=youtu.be">PyCon Talk</a></li>
<li><a href="https://black.now.sh/">Playground</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
To get in touch, email me at <a href="mailto:reacsdas@gmail.com">reacsdas@gmail.com</a> <br /><br />
Discuss and comment in <a href="https://t.me/reacsdas">Telegram</a> | <a href="https://github.com/paul-nameless">Github</a> | <a href="https://twitter.com/paul_nameless">Twitter</a><br/>
<br/>
<form action="https://42emails.com/api/email">
  <input type="text" name="email" placeholder="Email" />
  <input type="hidden" name="form_id" value="c88adf06aac24ae5b6798b33a1075330" />
  <input type="submit" value="Subscribe" /><br/>
</form>

<!-- Cloudflare Web Analytics -->
<script defer src='https://static.cloudflareinsights.com/beacon.min.js' data-cf-beacon='{"token": "2c0ad197c226461eaccf6861b45f1cf8"}'>
</script>
<!-- End Cloudflare Web Analytics -->
</div>
</body>
</html>
